# If нөхцөл шалгах

a = 56
b = 189
if b > a:
  print("b тоо нь a тооноос их") # if - н ард бичсэн нөхцөл үнэн тохиолдолд биелнэ


# if elif нөхцөл шалгах үйлдэл

# гараас утга оруулах // a=input() гэж бичиж болно
a = input("a тоо: ")
b = input("b тоо: ")

if b > a: # эхний нөхцөл
  print("b тоо нь a тооноос эрс их") # эхний нөхцөл үнэн бол биелнэ
elif a == b: # хоёрдахь нөхцөл, эхний нөхцөл худлаа бол энэ нөхцөлийг шалгана
  print("a болон b тэнцүү") # хоёрдахь нөхцөл үнэн бол биелнэ
else:
  print("a тоо нь b тооноос эрс их") # дээрх нөхцөлүүд биелээгүй тохиолдолд биелнэ



a = int(input())
b = int(input())
if a > b:
    ih = a
else:
    ih = b
print(ih)