1-Бодлого
# print(int(input())//2*2+2)
өгөгдсөн тооны дараагийн тэгш тоог олох


2-Бодлого
# n = int(input()) - гараас тоо оруулах 
# a = n % 10 - үлдэгдэлтэй хуваах
# b = n // 10 % 10 - аравтын цифрийг дангаар салгах
# c = n // 100 % 10 - зуутын цифрийг дангаар салгах
# d = n // 1000 % 10 - мянгатын цифрийг дангаар салгах
# e = n // 10000
# print(a + b + c + d + e)
өгөгдсөн 5 оронтой тооны цифрүүдийн нийлбэрийг олох


3-Бодлого
# n = int(input())
# z = n % 10
# x = n // 10 % 10
# c = n // 100 % 10
# v = z * x * c
# print(v // 2*2+2)
өгөгдсөн 3 оронтой тооны цифрүүдийн нийлбэрийн дараагийн тэгш тоог олох 
жнь 12 гарадах дагаарийн 14, хэрэв 13 байвал 14 болно

4-Бодлого
# n=int(input())
# z=n%10 = аравт хуваагаад үлдэгдлийг гаргах
# x=n//10%10 = өгөгдсөн тоог аравт хуваагаад бүхэл тоог дахин аварт хуваан үлдэгдлийг гаргах
# c=n//100%10 = өгөгдсөн тоог зууд хуваагаад бүхэл тоог дахин аварт хуваан үлдэгдлийг гаргах
# v=n//1000 = өгөгдсөн тоог мянгад хуваагаад бүхэл тоог гаргах
# print(z+x+c+v)
4 оронтой тооны цифрүүдийг салгаад, тэдгээрийн нийлбэрийг олох

5-Бодлого
# n=int(input())
# m=n//60 = өгөгдсөн тоог 60-д хувааж бүхэл тоог авч байна
# s=n%60 = өгөгдсөн тоог 60-д хувааж үлдэгдэл тоог авч байна
# print(m, ":" ,s)
өгөгдсөн тооны бүхэл болон үлдэгдэл тоог харуулах

6-Бодлого
# n=int(input())
# z=n%10
# x=n//10%10
# c=n//100%10
# v=n//1000%10
# b=n//10000
# print(z+x-v-b)

# ner=input()
# too=len(ner)
# print(ner[::-1])
